---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException
source: html/b518a7be-62e0-653c-c82b-4662b9722ce5.htm
---
# CannotOpenBothCentralAndLocalException Methods

Retrieves data needed to serialize the target object.